Tests/StressTest/1200VU_per_S/UseCaseA.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 100
      name: 1. Ramp Up
    - duration: 240
      arrivalRate: 50
      rampTo: 400
      name: 2. Ramp Up
    - duration: 240
      arrivalRate: 200
      rampTo: 1200
      name: 3. Ramp Up

scenarios:
  - name: "All recipes"
    flow:
      - get:
          url: "/recipes"
      - think: 2